{
    "global": {
        "name": "Jerome Depotter",
        "position": "Senior Engineering Manager",
        "avatar": "./files/jdepotter.jpeg"
    },
    "links": {
        "linkedin": "https://www.linkedin.com/in/jerome-depotter/",
        "github": "https://github.com/jdepotter",
        "resume": "/files/jdepotter.pdf"
    },
    "menu_items": [
        {
            "title": "Home",
            "icon": "home",
            "scrollTo": {
                "el": "#p-home"
            },
            "scrollToMobile": {
                "el": "#p-home",
                "offset": -48
            }
        },
        {
            "title": "About Me",
            "icon": "user",
            "scrollTo": {
                "el": "#p-about"
            },
            "scrollToMobile": {
                "el": "#p-about",
                "offset": -48
            }
        },
        {
            "title": "Experience",
            "icon": "laptop-code",
            "scrollTo": {
                "el": "#p-resume"
            },
            "scrollToMobile": {
                "el": "#p-resume",
                "offset": -48
            }
        },
        {
            "title": "Skills",
            "icon": "cogs",
            "scrollTo": {
                "el": "#p-skills"
            },
            "scrollToMobile": {
                "el": "#p-skills",
                "offset": -48
            }
        }
    ],
    "cards": {
        "about": "About Me",
        "experience": "Experience",
        "skills": "Skills"
    },
    "home": {
        "header": "Hi,",
        "paragraphs": [
            "I am <b class='p-large'>Jerome Depotter</b>. I am a <b class='p-large'>Senior Software Engineering Manager</b>",
            "<b>Experienced software engineering professional</b> with more than <b>10 years</b> in the field, with <b>3 years</b> spent in a leadership role as lead engineer and engineering manager.",
            "Driven by a deep <b>passion for technology</b> and a relentless commitment to <b>client satisfaction</b>, I excel in understanding and addressing client needs.",
            "With a focus on fostering <b>team growth and development</b>, I am a strong communicator dedicated to the success of every team member.",
            "My diverse background spans multiple domains, including oil and gas services, telecommunications, healthcare, and sales software. Eager to take on <b>new challenges</b>, I currently <b>lead a team of 5 engineers while overseeing a flagship product.</b>",
            "Recognized for my <b>excellent troubleshooting skills</b> and proactive problem-solving approach."
        ]
    },
    "about": {
        "info_left": [
            {
                "title": "Birthday",
                "value": "22 November, 1988"
            },
            {
                "title": "Location",
                "value": "Los Angeles, USA"
            },
            {
                "title": "Nationality",
                "value": "France"
            },
            {
                "title": "Languages",
                "value": "French, English"
            }
        ],
        "info_right": [
            {
                "title": "Education",
                "items": [
                    {
                        "header": "Master Degree in Computer Science (2012)",
                        "details": "Institut Nationale des Sciences Appliquees de Lyon, France",
                        "subDetails": "A french top leading school in Computer Science"
                    },
                    {
                        "header": "Bachelor Degree in Software and Firmware Science (2009)",
                        "details": "University Paul Sabatier, Toulouse, France"
                    }
                ]
            }
        ],
        "btn_resume": "Get My Resume"
    },
    "resume": {
        "items": [
            {
                "opposite": "Sep. 2022 - Present",
                "header_2": "SetSail (San Mateo, Remote)",
                "header_1": "Senior Software Engineering Manager",
                "header_3": "Python, Pandas, Docker, AWS (Athena,ECS, SQS, Lambda, ...), CircleCI, Node.js, Terraform, Salesforce, GPT",
                "details": [
                    "About <b>SetSail</b>: Our mission is to empower teams with a new way to sell. As the <b>first Revenue Execution Platform</b>, SetSail focuses sales on small wins that lead to the big win. SetSail uses machine learning and <b>AI</b> to identify key <b>buying signals</b> that lead to successful deals. SetSail then tracks those signals and allows sales leaders to create automated programs that <b>drive top rep behaviors.</b>",
                    "<b>Led the engineering efforts</b> for the <b>CRM Writeback</b> product, closely collaborating with the product manager to <b>scope, plan, and prioritize initiatives.</b>",
                    "<b>Managed and provided mentorship</b> to a team of 5 software engineers, including junior, senior and staff-level members working on CRM Writeback and SetSail AI",
                    "<b>Collaborated</b> with both engineering and data science teams to integrate <b>SetSail AI</b> features into CRM Writeback, amplifying value for our clients."
                ]
            },
            {
                "opposite": "Oct. 2021 - Sep. 2022",
                "header_2": "SetSail (San Mateo, Remote)",
                "header_1": "Software Engineering Manager",
                "header_3": "Python, Pandas, Docker, AWS (Athena,ECS, SQS, Lambda, ...), CircleCI, Node.js, Terraform, Salesforce",
                "details": [
                    "<b>Led the engineering efforts</b> for the <b>CRM Writeback</b> product, closely collaborating with the product manager <b>to scope, plan, and prioritize initiatives</b>. Drove the transformation of the product into a <b>mature and flagship offering</b>",
                    "<b>Managed and provided mentorship</b> to a team of 3 software engineers, including junior, senior and staff-level members",
                    "<b>Delivered key feature</b> that positioned us at the <b>forefront of the competitio</b>: Gong, Chorus and Outreach activities capture, events update and delete, activities multi attribution, contact bounced detection, ...",
                    "<b>Spearheaded collaboration efforts</b> with the customer success team to promptly address <b>client requests</b> and conduct comprehensive investigations into any client issues",
                    "<b>Collaborated</b> with the product manager, customer success, and sales representatives to implement the <b>CRM DGA (Data Gap Assessment) process</b>, aiding clients in understanding their requirements for a CRM Writeback tool. Demonstrated our activity mapping accuracy with Salesforce entities compared to our competitors",
                    "Defined <b>client integration and solution implementation processes</b> in collaboration with the customer success team. Partnered on the development of a <b>QA process</b> to guide clients in making optimal configuration choices. <b>Supervised</b> solution configuration and implementation.",
                    "Streamlined the <b>agile development</b> process and advocated for the adoption of <b>best practices</b>",
                    "<b>Overseen efforts</b> to improve <b>system performance</b>, <b>scalability</b>, and <b>code maintainability</b>"
                ]
            },
            {
                "opposite": "Apr. 2021 - Oct. 2022",
                "header_2": "SetSail (San Mateo, Remote)",
                "header_1": "Senior Software Engineer",
                "header_3": "Python, Pandas, Docker, AWS (Athena,ECS, SQS, Lambda, ...), CircleCI, Node.js, Terraform, Salesforce",
                "details": [
                    "<b>Played a significant role</b> in <b>CRM Writeback</b>, a cornerstone product at SetSail, by <b>spearheading software development</b> and <b>systems design</b> initiatives. CRM Writeback automates the capture and enrichment of all client sales data, ensuring a comprehensive, enriched, and up-to-date Salesforce CRM without the need for manual entry.",
                    "<b>Engaged closely</b> with product management to <b>conceptualize and define new features</b>, actively contributing to their implementation.",
                    "Collaborated with the customer success team to <b>swiftly address client requests</b> and thoroughly <b>investigate any client issues.</b>",
                    "Contributed to enhancing <b>system scalability</b>, <b>performance</b>, and <b>resilience.</b>"
                ]
            },
            {
                "opposite": "Nov. 2015 - Present",
                "header_2": "Transplant Connect (Los Angeles)",
                "header_1": "Full-Stack Software Engineer",
                "header_3": "C#, ASP.NET MVC 5 and Webform, SQL Server, REST API, HTML, CSS, jQuery, Node.js, Vue.js, Python, AWS, Bamboo, Octopus",
                "details": [
                    "Work on <b>iTransplant</b>, a web <b>Donation and Transplantation Platform</b> used by Organ Transplantation Agencies in the <b>US</b>, <b>Canada</b> and <b>Australia</b>",
                    "Software Engineer <b>front and back end</b> on iTransplant. Working in a team of 15 developers",
                    "<b>Design and implement</b> new features on iTransplant such as new pages, new components and <b>API interfaces</b>",
                    "Handle client reported production issues that need <b>development support</b>. Implement patches and hotfixes",
                    "Handle <b>production deployment</b> of new releases and patches using Bitbucket, Bamboo and Ocotopus",
                    "Participate to <b>estimation meetings</b> and <b>features building meetings</b>",
                    "Work on several other projects to <b>improve code quality</b> and <b>develop tools</b> used by the team"
                ]
            },
            {
                "opposite": "Jan. 2019 - Jun. 2020",
                "header_2": "Schlumberger (Remote)",
                "header_1": "Senior Software Engineer freelance",
                "header_3": "Node.js, Vue.js, Python, Protobuf, ZMQ Socket, Web Socket, PostgresSQL, Postgis, Docker, Arcgis",
                "details": [
                    "Work on <b>Aquatic Monitoring</b> a research project to supervise an <b>AUV</b>, <b>Autonomous Under-water Vehicle</b> used to inspect <b>subsea petroleum assets</b>",
                    "<b>Develop front and back end</b> of a web app used to <b>monitor communications</b> with a wireless subsea robot",
                    "<b>Develop front and back end</b> of a web app used to <b>visualize and positioned</b> in a <b>3D map</b>, subsea equipments and the AUV"
                ]
            },
            {
                "opposite": "Nov. 2015 - Nov. 2016",
                "header_2": "Insensi (New York)",
                "header_1": "Embedded Software Engineer",
                "header_3": "C, C++, WebRTC",
                "details": [
                    "Work on the firmware of <b>Ily</b>, a <b>smart home phone</b> based on Android",
                    "<b>Design and program</b> the integration of a <b>Bluetooth</b> handset",
                    "Work on the <b>improvement</b> of <b>VP8 video decoding</b> using hardware decoding"
                ]
            },
            {
                "opposite": "Jan. 2013 - Nov. 2015",
                "header_2": "Schlumberger (Paris)",
                "header_1": "Software Engineer",
                "header_3": "C#, WPF, SQL",
                "details": [
                    "Software engineer on <b>Muzic Acquisition</b>, a <b>flagship project</b> for Donwhole Testing. This project brings <b>real-time communication</b> between the surface and the <b>downhole tools</b> using <b>acoustic telemetry</b>. It permits to save time and <b>millions of dollars</b> during reservoir characterization",
                    "<b>Design and develop</b> the monitoring and acquisition software used at the surface",
                    "<b>Define new features</b> to improve the software and enable teams on the field to deliver the <b>best services</b> to the final client",
                    "Provide <b>reactive and efficient support</b> for teams on the field"
                ]
            },
            {
                "opposite": "Apr. 2012 - Sep. 2012",
                "header_2": "Thales (Paris)",
                "header_1": "Software Engineer Trainee",
                "header_3": "C++, C#, WPF",
                "details": [
                    "<b>Design and program</b> in C++ a <b>countermeasure system</b> for a military aircraft simulator",
                    "<b>Design and program</b> in C# and WPF, on my proposal, a <b>testing platform</b> using Bing Map to place threats and Microsoft Flight Simulator to manage aircraft position"
                ]
            }
        ]
    },
    "skills": {
        "categories": [
            {
                "title": "Expertise",
                "items": [
                    "Team Management", "Problem Solving", "Customer Satisfaction", "Mentorship", "Project Planning and Vision", "Team Growth and Collaboration"
                ]
            },
            {
                "title": "Technologies",
                "items": [
                    "Python", "Pandas", "JavaScript", "Node.js", "C#", "Go", "C++", "GPT", "Docker", "AWS (Athena,ECS, SQS, Lambda, S3, …)", "Terraform", "Salesforce Integration", "Gmail and Outlook Integration", "Dagster"
                ]
            },
            {
                "title": "Databases",
                "items": [
                    "SQL", "PostgreSQL", "DynamoDB", "PrestoDB", "mongoDB"
                ]
            },
            {
                "title": "Development lifecycle",
                "items": [
                    "VS Code", "Atlassian Suite", "Git", "Github", "Octopus", "CircleCI", "Shortcut"
                ]
            }
        ]
    },
    "projects": {
        "projects": [
            {
                "name": "Aquatic Monitoring",
                "content": [
                    {
                        "type": "text",
                        "val": [
                            "Aquatic Monitoring is a research project for the development of an Aunomous Under-water Vehicle (AUV) used to inspect oil and gas assets."
                        ]
                    },
                    {
                        "type": "text",
                        "val": [
                            "I have worked on this project as a freelancer for Schlumberger. My first task consisted on the design and implementation of a web server and web client to monitor the wireless communication with the AUV. ",
                            "Since the web server was not the only application communicating with the AUV, the latter was not directly sending messages to the network interface which communicate with the AUV. ",
                            "A software called Acquatic Monitoring Server is connected to the network interface and broadcasts answers through a ∅MQ socket. "

                        ]
                    },
                    {
                        "type": "text",
                        "val": [
                            "∅MQ gives sockets that carry atomic messages across various transports like inter-process or TCP. It allows request-response and publish-subscription communication. ",
                            "The communication with the AUV is asynchrone since sending and receiving messages through a wireless communication under-water takes multiple seconds. ",
                            "The request is sent through a request-response channel. Acquatic Monitoring Server responds with an ackknowledgment and sends the query to the AUV. The answer is broadcasted through a publish-subscription channel. "
                        ]
                    },
                    {
                        "type": "text",
                        "val": [
                            "The web server communicates with Aquatic Monitoring Server by sending messages encaspulated with Protobuf protocol through ∅MQ sockets and transmits the data to web clients. Clients send requests to the server using REST API and receive responses through web sockets. ",
                            "The web server is built with Node.js and Express.js. The client is made with Vue.js. Both Acquatic Monitoring Server and Acquatic Monitoring Web Server run on Docker on a machine installed on a boat. "
                        ]
                    },
                    {
                        "type": "text",
                        "val": [
                            "After having implemented the architecture and the wireless communication monitoring dashboard, I have added multiple features including a panel to send commands to move the AUV, display images sent by the AUV and configure and get data from sensors. "
                        ]
                    },
                    {
                        "type": "text",
                        "val": ["Schema of the architecture:"]
                    },
                    {
                        "type": "img",
                        "val": "/files/aquatic.png"
                    }
                ]
            }
        ]
    }
}
